#include <pthread.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>

#include "core/imp_alloc.h"

extern char _gp;
typedef struct VbmInstance VbmInstance;
extern VbmInstance *g_pVbmInstance;

int32_t IMP_Log_Get_Option(void); /* forward decl, ported by T<N> later */
int32_t imp_log_fun(int32_t level, int32_t option, int32_t type, ...); /* forward decl, ported by T<N> later */
int32_t IMP_Alloc(IMP_Alloc_Info *arg1, int32_t arg2, char *arg3); /* forward decl, ported by T<N> later */
int32_t IMP_Free(IMP_Alloc_Info *arg1, int32_t arg2); /* forward decl, ported by T<N> later */
int32_t IMP_PoolAlloc(int32_t arg1, IMP_Alloc_Info *arg2, int32_t arg3, char *arg4); /* forward decl, ported by T<N> later */
int32_t IMP_PoolFree(int32_t arg1, IMP_Alloc_Info *arg2, int32_t arg3); /* forward decl, ported by T<N> later */
int32_t IMP_FrameSource_GetPool(int32_t chn); /* forward decl, ported by T<N> later */
int32_t IMP_ISP_Tuning_GetAeZone(void *zone); /* forward decl, ported by T<N> later */
void _setLeftPart32(uint32_t leftpart); /* forward decl, ported by T<N> later */
uint32_t _setRightPart32(uint32_t rightpart); /* forward decl, ported by T<N> later */

typedef struct VBMFrame {
    int32_t index;          /* 0x000 */
    int32_t pool_idx;       /* 0x004 */
    int32_t width;          /* 0x008 */
    int32_t height;         /* 0x00c */
    int32_t pixfmt;         /* 0x010 */
    int32_t size;           /* 0x014 */
    uint32_t phys_addr;     /* 0x018 */
    uint32_t virt_addr;     /* 0x01c */
    uint8_t pad20[0x3c4];   /* 0x020 */
    uint8_t type;           /* 0x3e4 */
    uint8_t pad3e5;         /* 0x3e5 */
    uint16_t field_3e6;     /* 0x3e6 */
    int32_t field_3e8;      /* 0x3e8 */
    int32_t field_3ec;      /* 0x3ec */
    int32_t field_3f0;      /* 0x3f0 */
    uint8_t pad3f4[0x34];   /* 0x3f4 */
} VBMFrame;

typedef struct VBMFrameVolume {
    VBMFrame *frame;            /* 0x00 */
    uint32_t virt_addr;         /* 0x04 */
    uint32_t phys_addr;         /* 0x08 */
    int32_t ref_count;          /* 0x0c */
    uint8_t mutex_storage[0x18];/* 0x10 */
} VBMFrameVolume;

static void *vbm_instance[6];
static VBMFrameVolume g_framevolumes[0x1e];
static VBMFrame frame_type2;
static uint8_t print_cnt_vtv = 1;
static const char data_edab0[] = "vbm";

static inline pthread_mutex_t *vbm_volume_mutex(VBMFrameVolume *volume)
{
    return (pthread_mutex_t *)(void *)volume->mutex_storage;
}

static void vbm_assert_trap(void)
{
    volatile int *ptr = (volatile int *)(uintptr_t)0xc;

    IMP_Log_Get_Option();
    (void)*ptr;
    __builtin_trap();
}

void *VBMGetInstance(void)
{
    if (g_pVbmInstance == 0) {
        g_pVbmInstance = (VbmInstance *)vbm_instance;
    }

    return &vbm_instance;
}

int32_t VBMLockFrame(VBMFrame *arg1)
{
    int32_t i = 0;
    VBMFrame **v1 = &g_framevolumes[0].frame;

    do {
        VBMFrame *a1_1 = *v1;

        v1 = (VBMFrame **)((char *)v1 + 0x28);
        if (arg1 == a1_1) {
            int32_t s2_1 = i * 0x28;
