/**
 * IMP Encoder Module Implementation
 * Based on reverse engineering of libimp.so v1.1.6
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>
#include <time.h>
#include <sys/select.h>
#include <sys/eventfd.h>
#include <pthread.h>
#include <semaphore.h>
#include <imp/imp_encoder.h>
#include <imp/imp_system.h>
#include "fifo.h"
#include "codec.h"

/* External system functions */
extern void* IMP_System_GetModule(int deviceID, int groupID);

#define LOG_ENC(fmt, ...) fprintf(stderr, "[Encoder] " fmt "\n", ##__VA_ARGS__)
#define FIFO_SIZE 64  /* Size of Fifo structure */

/* Encoder channel structure - 0x308 bytes per channel */
#define MAX_ENC_CHANNELS 9
#define ENC_CHANNEL_SIZE 0x308
#define MAX_ENC_GROUPS 3

/* Internal stream buffer structure */
typedef struct {
    IMPEncoderPack pack;        /* Stream pack data */
    uint32_t seq;               /* Sequence number */
    int streamEnd;              /* Stream end flag */
    void *codec_stream;         /* Pointer to codec stream data */
    void *injected_buf;         /* If non-NULL, malloc'd buffer we must free */
} StreamBuffer;

typedef struct {
    int chn_id;                 /* 0x00: Channel ID (-1 = unused) */
    uint8_t data_04[0x4];       /* 0x04-0x07: Padding */
    void *codec;                /* 0x08: AL_Codec handle (offset arg1[2]) */
    int src_frame_cnt;          /* 0x0c: Source frame count (offset arg1[3]) */
    int src_frame_size;         /* 0x10: Source frame size (offset arg1[4]) */
    void *frame_buffers;        /* 0x14: Frame buffer array (offset arg1[5]) */
    uint8_t fifo[FIFO_SIZE];    /* 0x18: Fifo structure (offset arg1[6]) */
    uint8_t data_58[0x40];      /* 0x58-0x97: Padding to 0x98 */
    IMPEncoderCHNAttr attr;     /* 0x98: Channel attributes (0x70 bytes) */
    uint8_t data_108[0x8c];     /* 0x108-0x193: Padding */
    uint8_t data_194[0x44];     /* 0x194-0x1d7: Padding */
    pthread_mutex_t mutex_1d8;  /* 0x1d8: Mutex (offset arg1[0x6a]) */
    pthread_cond_t cond_1f0;    /* 0x1f0: Condition variable */
    uint8_t data_208[0x18];     /* 0x208-0x21f: Padding */
    int eventfd;                /* 0x220: Event FD */
    uint8_t data_224[0x70];     /* 0x224-0x293: Padding */
    void *group_ptr;            /* 0x294: Pointer to group */
    uint8_t data_298[0x100];    /* 0x298-0x397: More data */
    uint8_t registered;         /* 0x398: Registration flag */
    uint8_t data_399[0x7];      /* 0x399-0x39f: Padding */
    uint8_t data_3a0[0x4];      /* 0x3a0-0x3a3: More data */
    uint8_t enabled;            /* 0x3a4: Enable flag */
    uint8_t data_3a5[0x3];      /* 0x3a5-0x3a7: Padding */
    uint8_t data_3a8[0x4];      /* 0x3a8-0x3ab: More data */
    uint8_t started;            /* 0x3ac: Started flag */
    uint8_t data_3ad[0x53];     /* 0x3ad-0x3ff: More data */
    uint8_t recv_pic_enabled;   /* 0x400: Receive picture enabled */
    uint8_t data_401[0x3];      /* 0x401-0x403: Padding */
    uint8_t recv_pic_started;   /* 0x404: Receive picture started */
    uint8_t data_405[0x3];      /* 0x405-0x407: Padding */
    sem_t sem_408;              /* 0x408: Semaphore (offset arg1[0x102]) */
    sem_t sem_418;              /* 0x418: Semaphore (offset arg1[0x106]) */
    sem_t sem_428;              /* 0x428: Semaphore (offset arg1[0x10a]) */
    pthread_mutex_t mutex_438;  /* 0x438: Mutex (offset arg1[0x10e]) */
    pthread_mutex_t mutex_450;  /* 0x450: Mutex (offset arg1[0x114]) */
    pthread_t thread_encoder;   /* 0x468: Encoder thread (offset arg1[0x1a]) */
    pthread_t thread_stream;    /* 0x46c: Stream thread (offset arg1[0xf]) */
    uint8_t data_470[0x98];     /* 0x470-0x507: Padding */
    /* Total: 0x308 bytes (776 bytes) */

    /* Extended fields (not part of binary structure) */
    StreamBuffer *current_stream;  /* Current stream buffer */
    uint32_t stream_seq;           /* Stream sequence counter */
    int gop_length;                /* GOP length (offset 0x3d0) */
    int entropy_mode;              /* Entropy mode (offset 0x3fc) */
    int max_stream_cnt;            /* Max stream count (offset 0x4c0) */
    int stream_buf_size;           /* Stream buffer size (offset 0x4c4) */
} EncChannel;

/* Encoder group structure */
typedef struct {
    int group_id;               /* 0x00: Group ID */
    uint32_t field_04;          /* 0x04: Field */
    uint32_t chn_count;         /* 0x08: Number of registered channels */
    EncChannel *channels[3];    /* 0x0c-0x14: Up to 3 channels per group */
} EncGroup;

/* Global encoder state */
typedef struct {
    void *module_ptr;           /* 0x00: Module pointer */
    EncGroup groups[6];         /* 0x04: Up to 6 groups */
} EncoderState;

/* Global variables */
static EncoderState *gEncoder = NULL;
static EncChannel g_EncChannel[MAX_ENC_CHANNELS];
static pthread_mutex_t encoder_mutex = PTHREAD_MUTEX_INITIALIZER;
static int encoder_initialized = 0;

/* Forward declarations for helper functions */
static int channel_encoder_init(EncChannel *chn);
static int channel_encoder_exit(EncChannel *chn);
static int channel_encoder_set_rc_param(void *dst, IMPEncoderRcAttr *src);
static void *encoder_thread(void *arg);
static void *stream_thread(void *arg);
static int encoder_update(void *module, void *frame);
/* H.264 SPS/PPS caching and minimal Annex B parsing for prefix injection */
#define MAX_PARAM_SET_SIZE 256
static uint8_t g_last_sps[MAX_ENC_CHANNELS][MAX_PARAM_SET_SIZE];
static int g_last_sps_len[MAX_ENC_CHANNELS];
static uint8_t g_last_pps[MAX_ENC_CHANNELS][MAX_PARAM_SET_SIZE];
static int g_last_pps_len[MAX_ENC_CHANNELS];

